rufans/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @current_user_posts = Post.where(user_id: current_user.id)
    @posts = Post.none
    current_user.followees.each do |fl|

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2022-11-13 19:59:44.543742"], ["id", 50]]
---
  def edit
    respond_to do |format|
      format.turbo_stream do
        render turbo_stream: [ turbo_stream.update(@post,
                                                 partial: "posts/form",
                                                 locals: {post: @post}) ]

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", nil], ["body", "2322423423"], ["user_id", 1], ["created_at", "2023-01-29 16:08:01.684741"], ["updated_at", "2023-01-29 16:08:01.684741"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def like
    @post = Post.find(params[:id])