rufans/app/controllers/users_controller.rb

  def set_user
    @user = User.find_by(user_tag: params[:user_tag])
---
SELECT "users".* FROM "users" WHERE "users"."user_tag" = $1 LIMIT $2  [["user_tag", "1"], ["LIMIT", 1]]