rufans/app/controllers/users_controller.rb

  def profile
    # @user.update(views: @user.views + 1)
    # @posts = @user.posts.includes(:rich_text_body).order(created_at: :desc)
    # @total_views = 0

    # @posts.each do |post|
    #   @total_views += post.views
    # end
    @post = Post.new
    @posts = Post.where("user_id = #{@user.id}")
---
SELECT "posts".* FROM "posts" WHERE (user_id = 1) ORDER BY "posts"."created_at" DESC

  def talantes
    @talantes = User.where(role:  "seller")
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 1]]

  def follow
    @user = User.find(params[:id])
    Relationship.create_or_find_by(follower_id: current_user.id, followee_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 2], ["followee_id", 1], ["created_at", "2023-01-29 16:07:47.916785"], ["updated_at", "2023-01-29 16:07:47.916785"]]

  def set_user
    @user = User.find_by(user_tag: params[:user_tag])
---
SELECT "users".* FROM "users" WHERE "users"."user_tag" = $1 LIMIT $2  [["user_tag", "1"], ["LIMIT", 1]]