rufans/app/views/posts/_post.html.erb

          <button type="button" class="btn btn-sub-accent">
                <i class="fe fe-comment-o"> <%=post.comments.count%></i>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

    <div class="cardbox-comments">
      <%= render partial: 'comments/comment', collection: post.comments.where(parent_id: nil).order(created_at: :desc), locals: { user: user, post: post }%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_id" IS NULL ORDER BY "comments"."created_at" DESC  [["post_id", 1]]