rufans/app/views/posts/_post_owner.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_id" IS NULL ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
---
      <div class="cardbox-comments">
        <%= render partial: 'comments/comment', collection: post.comments.where(parent_id: nil).order(created_at: :desc), locals: { user: user }%>