rufans/app/models/user.rb

UPDATE "users" SET "user_tag" = $1 WHERE "users"."id" = $2  [["user_tag", "1"], ["id", 1]]
---
  def set_default_tag
    self.update_column(:user_tag, "#{self.id}")